tsung_tests/tsung_book_service_leave_rating.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/local/share/tsung/tsung-1.0.dtd" [] >
<tsung loglevel="notice">
  <clients>
    <client host="localhost" maxusers="32768" use_controller_vm="true" />
  </clients>

  <servers>
    <server host="kokinarimoto.eba-8zhfquyf.us-west-2.elasticbeanstalk.com" port="80" type="tcp"></server>
  </servers>

  <load>
    <arrivalphase phase="1" duration="5" unit="second">
      <users arrivalrate="1" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="2" duration="5" unit="second">
      <users arrivalrate="2" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="3" duration="5" unit="second">
      <users arrivalrate="4" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="4" duration="5" unit="second">
      <users arrivalrate="8" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="5" duration="5" unit="second">
      <users arrivalrate="16" unit="second"></users>
    </arrivalphase>
  </load>

  <options>
    <!-- Set connection timeout to 2 seconds -->
    <option name="global_ack_timeout" value="2000"></option>
    <!-- available client ports to run concurrent connections -->
    <option name="ports_range" min="1025" max="65535"/>
  </options>

<!--Scenario: Log in / See and Find a Service / Book a Service / Choose Availability / Logout-->
<sessions>
    <session name="client-booking" probability="100" type="ts_http">
        <transaction name="booking">

        <!-- start out at the root but send to login -->
        <request>
          <http url='/' version='1.1' method='GET'></http>
        </request>
        <request>
          <http url='/login' version='1.1' method='GET'></http>
        </request>
        
        <!-- wait for up to 5 seconds, user is thinking about login info -->
        <thinktime value="2" random="true"></thinktime>

        <!-- login -->
        <request subst="true">
          <http 
            url="/login" 
            method="POST" 
            version="1.1" 
            contents="session[email]=User%%random_user%%@ucsb.com&amp;
                      session[password]=%%user_password%%&amp;commit=Login" 
            content_type="application/x-www-form-urlencoded"  />
        </request>

        <!-- send to root directory and see the service list -->
        <request>
          <http url='/'
                method='GET'
                version='1.1'>
          </http>
        </request>

         <request>
          <http url='/book-service'
                method='GET'
                version='1.1'>
          </http>
        </request>

        <thinktime value="2" random="true"></thinktime>

        <!-- send to book service page -->
        <request>
          <dyn_variable name="services_id" re="[Ll]ocation: (.*)\r"/>
          <http url='/book-service'
                method='POST'
                version='1.1' 
                contents="service[availability]=Availability&amp;
                          commit=Booking" 
                content_type="application/x-www-form-urlencoded">
          </http>
        </request>

        <request>
          <http url='/services'
                method='GET'
                version='1.1'>
          </http>
        </request>

        <request>
          <http url='/services/reviews'
                method='GET'
                version='1.1'>
          </http>
        </request>

        <request>
          <http url='/services/reviews/%%_services_id%%/edit'
                method='GET'
                version='1.1'>
          </http>
        </request>

        <thinktime value="2" random="true"></thinktime>
        
        <request>
          <http url='/services/reviews/%%_services_id%%/edit'
                method='PUT'
                version='1.1' 
                contents="rating[availability]=availability&amp;
                          rating[description]=description&amp;
                          rating[title]=title&amp;
                          rating[rating]=rating&amp;
                          commit=Booking" 
                content_type="application/x-www-form-urlencoded">
          </http>
        </request>

        <request>
          <http url='/services/reviews'
                method='GET'
                version='1.1'>
          </http>
        </request>

        <!-- signout -->
        <request>
          <http url="/logout" version="1.1" method="DELETE"/>
        </request>

        </transaction>
    </session>
  </sessions>
</tsung>