tsung_tests/tsung_register.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/local/share/tsung/tsung-1.0.dtd" [] >
<tsung loglevel="notice">
  <clients>
    <client host="localhost" maxusers="32768" use_controller_vm="true" />
  </clients>

  <servers>
    <server host="koki.eba-8zhfquyf.us-west-2.elasticbeanstalk.com" port="80" type="tcp"></server>
  </servers>

  <load>
    <arrivalphase phase="1" duration="10" unit="second" wait_all_sessions_end="true">
      <users arrivalrate="1" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="2" duration="10" unit="second" wait_all_sessions_end="true">
      <users arrivalrate="2" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="3" duration="10" unit="second" wait_all_sessions_end="true">
      <users arrivalrate="4" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="4" duration="10" unit="second" wait_all_sessions_end="true">
      <users arrivalrate="8" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="5" duration="10" unit="second" wait_all_sessions_end="true">
      <users arrivalrate="16" unit="second"></users>
    </arrivalphase>
  </load>

  <options>
    <!-- Set connection timeout to 2 seconds -->
    <option name="global_ack_timeout" value="2000"></option>
  </options>

  <sessions>
    <session name="main" type="ts_http" weight="1">
      <transaction name="register">

        <!-- create a random user_id -->
        <setdynvars sourcetype="random_number" start="1" end="99999">
          <var name="random_user" />
        </setdynvars>
        <setdynvars sourcetype="random_string" length="15">
          <var name="user_password" />
        </setdynvars>


        <!-- start out at the root but send to login -->
        <request> <http url='/' version='1.1' method='GET'></http> </request>
        <request> <http url='/login' version='1.1' method='GET'></http> </request>
        <request> <http url='/register' version='1.1' method='GET'></http> </request>
        
        <!-- wait for up to 2 seconds, user is thinking about login info -->
        <thinktime value="2" random="true"></thinktime>

        <request subst="true">
          <http 
            url="/register" 
            method="POST" 
            version="1.1" 
            contents="user[username]=cia%%_random_user%%&amp;
                user[password]=%%_user_password%%&amp;
                user[password_confirmation]=%%_user_password%%&amp;
                commit=Register" 
            content_type="application/x-www-form-urlencoded" />
        </request>

        <!-- send to root directory and see the service list -->
        <request> <http url='/' version='1.1' method='GET'></http> </request>
        <request> <http url='/login' version='1.1' method='GET'></http> </request>

        <thinktime value="2" random="true"></thinktime>
        <request subst="true">
          <http 
            url="/login" 
            method="POST" 
            version="1.1" 
            contents="login[username]=cia%%_random_user%%&amp;
                login[password]=%%_user_password%%&amp;
                commit=Log in" 
            content_type="application/x-www-form-urlencoded" />
        </request>

        <request> <http url='/' version='1.1' method='GET'></http> </request>

        <!-- Log out -->
        <request subst="true">
          <http 
            url="/logout" 
            method="DELETE" 
            version="1.1" 
            contents="_method=delete" 
            content_type="application/x-www-form-urlencoded" />
        </request>

      </transaction>
    </session>
  </sessions>
</tsung>